<template>
  <div class="about">
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
    <h1>预警列表页面</h1>
  </div>
</template>

<script>    
export default {
    name: "hello",
    data() {
        return {
            msg: "Welcome to Your Vue.js App",
            scroll: ''
        };
    },
    mounted() {
        // console.log('454646')
        // // 滚动事件
        // window.addEventListener('scroll', this.debounce(this.handle, 1000));
        // window.addEventListener('scroll', ()=>{
        //     console.log(11213);
        // });
        // window.addEventListener('scroll', this.menu)
         window.addEventListener('scroll',this.handleScroll) // 监听滚动事件，然后用handleScroll这个方法进行相应的处理
    },
    methods: {
        // debounce(fn, wait){
        //     var timeout = null;      //定义一个定时器
        //     return function() {
        //         if(timeout !== null) 
        //                 clearTimeout(timeout);  //清除这个定时器
        //         timeout = setTimeout(fn, wait);  
        //     }
        // },
        //  handle() {
        //     console.log(Math.random()); 
        // }
        menu() {
            this.scroll = document.body.scrollTop;
            console.log(this.scroll)
        },
        handleScroll(){
            console.log('454654654');
        }
    }
};


</script>

<style lang="scss" rel="stylesheet/scss" scope>
.about {
    h1 {
        margin-top: 50px;
    }
}
</style>